In [1]:
import pandas as pd
import numpy as np
import seaborn as sns                       #visualisation
import matplotlib.pyplot as plt             #visualisation
%matplotlib inline     
sns.set(color_codes=True)
import pandas_profiling as pp

In [2]:
l=[1,2,3]
l.reverse()
print(l)
#Use tab after '.' to search different options

[3, 2, 1]

In [3]:
import math

In [4]:
math.sin(2)

0.9092974268256817

Out[input the number of the previous output]**2

#print past results using Out

In [5]:
print(_)

#print previous output with _. you can use a double underscore to access the
#second-to-last output, and a triple underscore to access the third-to-last output

0.9092974268256817

In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
arr = np.arange(10)

In [8]:
arr

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [9]:
fruit='apple'
if fruit=='Apple':
    print('The fruit is an apple')
elif fruit=='Orange':
    print('The fruit is an orange')
else:
    print('The fruit is unidentified')

The fruit is unidentified

In [10]:
data={
'apples':[3,2,0,1],
'oranges':[0,3,7,2]
}
#There armany ways to create a DataFrame from scratch, but a great option is to just usea simple dict
#EG We want to have a column for each fruit and a row for each customer purchase. 
#To organize this as a dictionary forpandas we could do something like the above:

In [11]:
purchases=pd.DataFrame(data)

purchases

#And then pass it to the pandas DataFrame constructor:

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [12]:
#Let's have customer names as our index:

purchases=pd.DataFrame(data, index=['Rob', 'May', 'Peter', 'Ned'])

purchases

       apples  oranges
Rob         3        0
May         2        3
Peter       0        7
Ned         1        2

In [13]:
purchases ['apples']

Rob      3
May      2
Peter    0
Ned      1
Name: apples, dtype: int64

In [14]:
purchases.loc['May']

#locate a purchase by name

apples     2
oranges    3
Name: May, dtype: int64

In [15]:
import sqlite3
con=sqlite3.connect("database.db")

In [16]:
original_list = [10, 12, 17, 29, 4, 6]
new_list = []

for num in original_list:
    if num % 2 == 0:
        new_list.append(num)

new_list

[10, 12, 4, 6]

## Class 8 Data Cleaning Practice

In [17]:
#create dictionary

data={
    'name':['A', 'B', 'C', 'D', 'E'],
    'score':[56, 45, 87,np.nan, 99],
    'address':['Goa', 'Mumbai', 'Delhi', np.nan, 'Mysore'],
    'height': [165, 3, 170,np.nan, 167],
    'weight':[56, 65, 58,np.nan, 60]
}

#use np.nan to include null values. first import numpy as np

In [18]:
student_df=pd.DataFrame(data)

student_df

#convert dict to dataframe

  name  score address  height  weight
0    A   56.0     Goa   165.0    56.0
1    B   45.0  Mumbai     3.0    65.0
2    C   87.0   Delhi   170.0    58.0
3    D    NaN     NaN     NaN     NaN
4    E   99.0  Mysore   167.0    60.0

In [19]:
type(student_df)

#check type

pandas.core.frame.DataFrame

In [20]:
student_df.loc[3]

#locate by index

name         D
score      NaN
address    NaN
height     NaN
weight     NaN
Name: 3, dtype: object

In [21]:
student_df.isnull().sum()

#check for null values

name       0
score      1
address    1
height     1
weight     1
dtype: int64

In [22]:
student_df.dropna()

#drop null values

  name  score address  height  weight
0    A   56.0     Goa   165.0    56.0
1    B   45.0  Mumbai     3.0    65.0
2    C   87.0   Delhi   170.0    58.0
4    E   99.0  Mysore   167.0    60.0

**Dropping unnecessary Columns**

When we receive the data from stakeholders, generally it is huge. There can be a log ofdata that might not add any value to our model. Such data is better removed as it wouldvaluable resources like memory and processing time.
For example, while looking at students’ performance over a test, students’ weight or theirheight does not have anything to contribute to the model.

In [23]:
#student_df.drop(['height','weight'], axis=1, inplace=True)

#Drops Height column form the dataframe

#student_df.drop(['height', 'weight'], axis=1)


#Not working. Error message not picking up columns. See below for work around

In [24]:
#alternate way to create a dataframe from dict

#.fromdict method

#By default the keys of the dict become the DataFrame columns:

df = pd.DataFrame.from_dict(data)

df

  name  score address  height  weight
0    A   56.0     Goa   165.0    56.0
1    B   45.0  Mumbai     3.0    65.0
2    C   87.0   Delhi   170.0    58.0
3    D    NaN     NaN     NaN     NaN
4    E   99.0  Mysore   167.0    60.0

In [25]:
new_df=df.drop(['height','weight'], axis=1)

#By default, the drop() function uses axis=0, which refers to the rows of the DataFrame.

#Since there is no row name called “points” we receive an error.

#How to Fix the Error
#To tell pandas to look at the columns instead, we must specify axis=1 as follows:

new_df

  name  score address
0    A   56.0     Goa
1    B   45.0  Mumbai
2    C   87.0   Delhi
3    D    NaN     NaN
4    E   99.0  Mysore

In [26]:
new_df.dropna()
#remove null values after removing unneccessary columns

  name  score address
0    A   56.0     Goa
1    B   45.0  Mumbai
2    C   87.0   Delhi
4    E   99.0  Mysore

**Renaming columns**

It’s always better to rename the columns and format them to the most readable formatwhich can be understood by both the data scientist and the business. For example in thestudent data set, renaming the column “name” as “Sudent_Name” makes it meaningful.

In [31]:
new_df=new_df.rename(columns={'name': 'Student_Name', 'address': 'Addy'})

new_df

  Student_Name  score    Addy
0            A  56.00     Goa
1            B  45.00  Mumbai
2            C  87.00   Delhi
3            D  71.75     NaN
4            E  99.00  Mysore

**Treating missing values**


There are many ways to take care of the missing values in a dataset. It’s up to the datascientist and the dataset in hand to choose the most appropriate method. The mostcommonly used methods are imputing the dataset with mean, median, or mode.Removing those particular records with one or more values missing and in some casescreating machine learning algorithms like linear regression and K nearest neighbor is alsoused for treating the missing values.

In [32]:
new_df['score'].fillna((new_df['score'].mean()), inplace=True)
# Na values in col_name is replaced with mean
# NaN values in 'col_name' is replaced with mean


new_df

  Student_Name  score    Addy
0            A  56.00     Goa
1            B  45.00  Mumbai
2            C  87.00   Delhi
3            D  71.75     NaN
4            E  99.00  Mysore

In [34]:
df_copy = new_df.copy()
df_copy['Addy'] = df_copy['Addy'].fillna('LA LA Land')

df_copy

  Student_Name  score        Addy
0            A  56.00         Goa
1            B  45.00      Mumbai
2            C  87.00       Delhi
3            D  71.75  LA LA Land
4            E  99.00      Mysore